app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    product=Product.find(params[:id])

INSERT INTO "products" ("name", "brand", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "cvfv d"], ["brand", nil], ["price", nil], ["created_at", "2023-12-26 15:17:47.983256"], ["updated_at", "2023-12-26 15:17:47.983256"]]
---
  def create
    product=Product.new( product_params)
    if product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 9]]
---
  def destroy
    product=Product.find(params[:id])
    product.destroy